<script lang="ts">
    import Footer from '$components/Footer.svelte';
    import type { PageProps } from './$types';

    let { data }: PageProps = $props();
</script>

<h1>
    <a href="/">
        <img src="/favicon.svg" alt="Platform logo" width="45px"/>
    </a>
    <span>Ваша заједница</span>
</h1>

<section>
    <p>Платформа <i>”Ваша заједница”</i> својим корисницима омогућава:</p>
    <ul>
        <li>Давања транспарентних предлога за промене</li>
        <li>Предлагање привремених радних група као извршиоца усвојених предлога</li>
        <li>Гласачки систем доступан 24/7 (базиран на већинском принципу)</li>
        <li>Учествовање свих чланова у процесу доношења одлука </li>
        <li>Категоризацију предлога у више области</li>
        <li>Једноставност употребе</li>
    </ul>
</section>

<section>
    <p>Основни <b>принципи</b> платформе:</p>
    <ul>
        <li>Укључивост</li>
        <li>Транспарентност</li>
        <li>Привременост</li>
        <li>Промењивост</li>
        <li>Једноставност употребе</li>
    </ul>
</section>

<section>
    <p>
        Софтверски кôд платформе је отвореног типа и доступан је 
        <a href="https://github.com/vexy/pocket-community" target="_blank">на Github платформи</a>.
    </p>
    <p>Направљено у Србији 🇷🇸, марта 2025. године</p>
</section>

<Footer isLeading={true} />

<style>
    h1 {
        align-self: center;
        display: flex;
        align-items: center;
        gap: 1.25rem;
    }

    section {
        align-self: center;
    }

    section:nth-of-type(3) {
        flex-grow: 1;
    }

    p {
        margin-inline: 0.8rem;
    }

    ul {
        font-family: inherit;
        font-size: larger;
    }
</style>